Tekla Open API Reference for Tekla Structures 2025
ModelHistory.GetLocalChanges Method
Get changes which are not written out.
 Namespace: Tekla.Structures.Model.History
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static ModificationInfo GetLocalChanges()
Public Shared Function GetLocalChanges As ModificationInfo
Return Value
Type: ModificationInfo
Modifications which are not written out.
See Also
Reference
ModelHistory Class
Tekla.Structures.Model.History Namespace